Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/handling-events_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: handling-events title: Handling Events permalink: docs/handling-events.html prev: state-and-lifecycle.html next: conditional-rendering.html redirect_from:
ja: --- id: handling-events title: イベント処理 permalink: docs/handling-events.html prev: state-and-lifecycle.html next: conditional-rendering.html redirect_from:

source: Handling events with React elements is very similar to handling events on DOM elements.
ja: React でのイベント処理は DOM 要素のイベントの処理と非常に似ています。

source: There are some syntax differences:
ja: いくつかの文法的な違いがあります：

source: * React events are named using camelCase, rather than lowercase.
ja: * React のイベントは小文字ではなく camelCase で名付けられています。

source: * With JSX you pass a function as the event handler, rather than a string.
ja: * JSX ではイベントハンドラとして文字列ではなく関数を渡します。

source: For example, the HTML:
ja: 例えば、以下の HTML：

source: is slightly different in React:
ja: は、React では少し異なります：

source: Another difference is that you cannot return `false` to prevent default behavior in React.
ja: 別の違いとして、React では `false` を返してもデフォルトの動作を抑止することができません。

source: You must call `preventDefault` explicitly.
ja: 明示的に `preventDefault` を呼び出す必要があります。

source: For example, with plain HTML, to prevent the default form behavior of submitting, you can write:
ja: 例えば、プレーンな HTML では、「フォームをサブミットする」という form 要素のデフォルト動作を抑止するために次のように書くことができます。

source: In React, this could instead be:
ja: React では、代わりに次のようになります：

source: Here, `e` is a synthetic event.
ja: ここで、`e` は合成 (synthetic) イベントです。

source: React defines these synthetic events according to the [W3C spec](https://www.w3.org/TR/DOM-Level-3-Events/), so you don't need to worry about cross-browser compatibility.
ja: React はこれらの合成イベントを [W3C の仕様](https://www.w3.org/TR/DOM-Level-3-Events/)に則って定義しているので、ブラウザ間の互換性を心配する必要はありません。

source: React events do not work exactly the same as native events.
ja: React のイベントはネイティブのイベントと全く同様に動作するわけではありません。

source: See the [`SyntheticEvent`](/docs/events.html) reference guide to learn more.
ja: 詳細については、[`SyntheticEvent`](/docs/events.html) のリファレンスガイドを参照してください。

source: When using React, you generally don't need to call `addEventListener` to add listeners to a DOM element after it is created.
ja: React を使う場合、一般的には DOM 要素の生成後に `addEventListener` を呼び出してリスナを追加する必要はありません。

source: Instead, just provide a listener when the element is initially rendered.
ja: 代わりに、要素が最初にレンダーされる際にリスナを指定するようにしてください。

source: When you define a component using an [ES6 class](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes), a common pattern is for an event handler to be a method on the class.
ja: コンポーネントを [ES6 のクラス](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Classes)を使用して定義した場合、一般的なパターンではイベントハンドラはクラスのメソッドになります。

source: For example, this `Toggle` component renders a button that lets the user toggle between "ON" and "OFF" states:
ja: 例えば、以下の `Toggle` コンポーネントはユーザが "ON" 状態 "OFF" 状態を切り替えられるようなボタンをレンダーします。

source: You have to be careful about the meaning of `this` in JSX callbacks.
ja: JSX のコールバックにおける `this` の意味に注意しなければなりません。

source: In JavaScript, class methods are not [bound](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_objects/Function/bind) by default.
ja: JavaScript では、クラスのメソッドはデフォルトでは[バインド](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Global_objects/Function/bind)されません。

source: If you forget to bind `this.handleClick` and pass it to `onClick`, `this` will be `undefined` when the function is actually called.
ja: `this.handleClick` へのバインドを忘れて `onClick` に渡した場合、実際に関数が呼ばれた時に `this` は `undefined` となってしまいます。

source: This is not React-specific behavior; it is a part of [how functions work in JavaScript](https://www.smashingmagazine.com/2014/01/understanding-javascript-function-prototype-bind/).
ja: これは React に限った動作ではなく、[JavaScript における関数の仕組み](https://www.smashingmagazine.com/2014/01/understanding-javascript-function-prototype-bind/)の一部です。

source: Generally, if you refer to a method without `()` after it, such as `onClick={this.handleClick}`, you should bind that method.
ja: 一般的に、`onClick={this.handleClick}` のように `()` を末尾に付けずに何らかのメソッドを参照する場合、そのメソッドはバインドしておく必要があります。

source: If calling `bind` annoys you, there are two ways you can get around this.
ja: `bind` の呼び出しが苦痛なら、それを回避する方法が 2 つあります。

source: If you are using the experimental [public class fields syntax](https://babeljs.io/docs/plugins/transform-class-properties/), you can use class fields to correctly bind callbacks:
ja: 実験的な[パブリッククラスフィールド構文](https://babeljs.io/docs/plugins/transform-class-properties/)を使用しているなら、コールバックを正しくバインドするのにクラスフィールドを利用できます：

source: This syntax is enabled by default in [Create React App](https://github.com/facebookincubator/create-react-app).
ja: この構文は、[Create React App](https://github.com/facebookincubator/create-react-app) ではデフォルトで有効です。

source: If you aren't using class fields syntax, you can use an [arrow function](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions) in the callback:
ja: クラスフィールド構文を使用していない場合、コールバック内で[アロー関数](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Functions/Arrow_functions)を使用することもできます：

source: The problem with this syntax is that a different callback is created each time the `LoggingButton` renders.
ja: この構文での問題は、`LoggingButton` がレンダーされるたびに異なるコールバック関数が毎回作成されるということです。

source: In most cases, this is fine.
ja: 大抵のケースではこれは問題ありません。

source: However, if this callback is passed as a prop to lower components, those components might do an extra re-rendering.
ja: しかし、このコールバックが props の一部として下層のコンポーネントに渡される場合、それら下層コンポーネントが余分に再描画されることになります。

source: We generally recommend binding in the constructor or using the class fields syntax, to avoid this sort of performance problem.
ja: 一般的にはコンストラクタでバインドするかクラスフィールド構文を使用して、この種のパフォーマンスの問題を避けるようおすすめします。

source: ## Passing Arguments to Event Handlers {#passing-arguments-to-event-handlers}
ja: ## イベントハンドラに引数を渡す {#passing-arguments-to-event-handlers}

source: Inside a loop, it is common to want to pass an extra parameter to an event handler.
ja: ループ内では、イベントハンドラに追加のパラメータを渡したくなることがよくあります。

source: For example, if `id` is the row ID, either of the following would work:
ja: 例えば、`id` という行の ID がある場合、以下のどちらでも動作します：

source: The above two lines are equivalent, and use [arrow functions](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions) and [`Function.prototype.bind`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_objects/Function/bind) respectively.
ja: 上記の 2 行は等価であり、上側では[アロー関数](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Functions/Arrow_functions)が、下側では [`Function.prototype.bind`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_objects/Function/bind) が使われています。

source: In both cases, the `e` argument representing the React event will be passed as a second argument after the ID.
ja: どちらの場合でも、React イベントを表す `e` という引数は ID の次の 2 番目の引数として渡されることになります。

source: With an arrow function, we have to pass it explicitly, but with `bind` any further arguments are automatically forwarded.
ja: アロー関数では `e` を明示的に渡す必要がありますが、`bind` の場合には `id` 以降の追加の引数は自動的に転送されます。
